Revit 2015 API
AnalyticalModel.SetAlignmentMethod Method
 Sets the alignment method for a given selector and direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Alignment has been divided into Alignment and Extension. Use AnalyticalModelStick.SetAlignmentMethod() method or AnalyticalModelColumn.BaseExtensionMethod, AnalyticalModelColumn.TopExtensionMethod, AnalyticalModelSurface.AlignmentMethod, AnalyticalModelSurface.BottomExtensionMethod, AnalyticalModelSurface.TopExtensionMethod properties instead.")]
public void SetAlignmentMethod(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	AnalyticalAlignmentMethod method
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Alignment has been divided into Alignment and Extension. Use AnalyticalModelStick.SetAlignmentMethod() method or AnalyticalModelColumn.BaseExtensionMethod, AnalyticalModelColumn.TopExtensionMethod, AnalyticalModelSurface.AlignmentMethod, AnalyticalModelSurface.BottomExtensionMethod, AnalyticalModelSurface.TopExtensionMethod properties instead.")> _
Public Sub SetAlignmentMethod ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection, _
	method As AnalyticalAlignmentMethod _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. Analytical Alignment has been divided into Alignment and Extension. Use AnalyticalModelStick.SetAlignmentMethod() method or AnalyticalModelColumn.BaseExtensionMethod, AnalyticalModelColumn.TopExtensionMethod, AnalyticalModelSurface.AlignmentMethod, AnalyticalModelSurface.BottomExtensionMethod, AnalyticalModelSurface.TopExtensionMethod properties instead.")]
public:
void SetAlignmentMethod(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	AnalyticalAlignmentMethod method
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction of the analytical model.
method
Type: Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
 The alignment method at a given end.
Remarks
 Applicable for analytical models of linear elements (beams, braces, columns).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  direction is invalid for analytical model -or- method is in valid for analytical model
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace